Revit 2026 API

# RenderingImageExposureSettingsHighlights Property

---

The highlights value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Highlights { get; set; }
```
```vb
Public Property Highlights As Double
	Get
	Set
```
```cpp
public:
property double Highlights {
	double get ();
	void set (double value);
}
```
```fsharp
member Highlights : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value of highlights is not valid. The valid range is 0 to 1. |

Increase this value to get brighter highlights.

#### Reference

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace